app/Helpers/Helpers.php

insert into `user_logs` (`user_id`, `type`, `latitude`, `longitude`, `ip_address`, `user_agent`, `created_at`, `updated_at`) values (1, 'login', '', '', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/143.0.0.0 Safari/537.36', '2025-12-19 11:29:07', '2025-12-19 11:29:07')
---
    function saveUserLogs($type)
    {
        $userId = 0;
        if (Auth::check()) {
            $userId = Auth::id();
        }

        DB::table('user_logs')->insert([
            'user_id' => $userId,
            'type' => $type,
            'latitude' => request()->latitude,
            'longitude' => request()->longitude,
            'ip_address' => request()->ip(),
            'user_agent' => request()->header('User-Agent'),
            'created_at' => date('Y-m-d H:i:s'),
            'updated_at' => date('Y-m-d H:i:s')
        ]);

insert into `user_login_attempts` (`username`, `password`, `status`, `latitude`, `longitude`, `ip_address`, `user_agent`, `created_at`, `updated_at`) values ('super_admin', 'Admin@p!t6', 'Success', '', '', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/143.0.0.0 Safari/537.36', '2025-12-19 11:29:07', '2025-12-19 11:29:07')
---
    function saveUserLogInAttempts($status)
    {
        $userId = 0;
        if (Auth::check()) {
            $userId = Auth::id();
        }

        DB::table('user_login_attempts')->insert([
            'username' => request()->username,
            'password' => request()->password,
            'status' => $status,
            'latitude' => request()->latitude,
            'longitude' => request()->longitude,
            'ip_address' => request()->ip(),
            'user_agent' => request()->header('User-Agent'),
            'created_at' => date('Y-m-d H:i:s'),
            'updated_at' => date('Y-m-d H:i:s')
        ]);