app/Http/Controllers/VehicleController.php

    public function update(Request $request, Vehicle $vehicle)
    {
        $data = $request->validate([
            'name' => 'required|string|max:255',
            'seats' => 'required|integer|min:1|max:50',
            'bags_capacity' => 'required|integer|min:0|max:50',
            'features' => 'nullable|string',
            'vehicle_image' => 'nullable|image|mimes:jpg,jpeg,png|max:2048',
            'is_active' => 'sometimes|boolean',
        ]);

        // Features handling
        if ($request->filled('features')) {
            $data['features'] = array_filter(array_map('trim', explode(',', $request->features)));
        } else {
            $data['features'] = null;
        }

        // Handle image upload via Media Library
        if ($request->hasFile('vehicle_image')) {
            // Clear old images from the 'vehicles' collection and add the new one
            $vehicle->clearMediaCollection('vehicles');
            $vehicle->addMediaFromRequest('vehicle_image')
                ->toMediaCollection('vehicles');
        }

        // Remove vehicle_image from data array before updating
        unset($data['vehicle_image']);

        // $data['is_active'] = $request->has('is_active');
        $vehicle->update($data);
---
update `vehicles` set `is_active` = 1, `vehicles`.`updated_at` = '2025-12-19 15:41:23' where `id` = 6